bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA64D3.xml
        <module name="PR" id="I6073" version="XMEGAD" caption="Power Reduction">
            <register-group caption="Power Reduction" name="PR" size="7">
                <register caption="General Power Reduction" name="PRGEN" offset="0x00" size="1">
                    <bitfield caption="Real-time Counter" mask="0x04" name="RTC"/>
                    <bitfield caption="Event System" mask="0x02" name="EVSYS"/>
                </register>
                <register caption="Power Reduction Port A" name="PRPA" offset="0x01" size="1">
                    <bitfield caption="Port A ADC" mask="0x02" name="ADC"/>
                    <bitfield caption="Port A Analog Comparator" mask="0x01" name="AC"/>
                </register>
                <register caption="Power Reduction Port C" name="PRPC" offset="0x03" size="1">
                    <bitfield caption="Port C Two-wire Interface" mask="0x40" name="TWI"/>
                    <bitfield caption="Port C USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port C SPI" mask="0x08" name="SPI"/>
                    <bitfield caption="Port C HIRES" mask="0x04" name="HIRES"/>
                    <bitfield caption="Port C Timer/Counter1" mask="0x02" name="TC1"/>
                    <bitfield caption="Port C Timer/Counter0" mask="0x01" name="TC0"/>
                </register>
                <register caption="Power Reduction Port D" name="PRPD" offset="0x04" size="1">
                    <bitfield caption="Port D USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port D SPI" mask="0x08" name="SPI"/>
                    <bitfield caption="Port D Timer/Counter0" mask="0x01" name="TC0"/>
                </register>
                <register caption="Power Reduction Port E" name="PRPE" offset="0x05" size="1">
                    <bitfield caption="Port E Two-wire Interface" mask="0x40" name="TWI"/>
                    <bitfield caption="Port E USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port E Timer/Counter0" mask="0x01" name="TC0"/>
                </register>
                <register caption="Power Reduction Port F" name="PRPF" offset="0x06" size="1">
                    <bitfield caption="Port F USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port F Timer/Counter0" mask="0x01" name="TC0"/>
                </register>
            </register-group>
        </module>
        <module name="SLEEP" id="I6081" caption="Sleep Controller">
            <register-group caption="Sleep Controller" name="SLEEP" size="1">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Sleep Mode" mask="0x0E" name="SMODE" values="SLEEP_SMODE"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SEN"/>
                </register>
            </register-group>
            <value-group caption="Sleep Mode" name="SLEEP_SMODE">
                <value caption="Idle mode" name="IDLE" value="0x00"/>
                <value caption="Power-down Mode" name="PDOWN" value="0x02"/>
                <value caption="Power-save Mode" name="PSAVE" value="0x03"/>
                <value caption="Standby Mode" name="STDBY" value="0x06"/>
                <value caption="Extended Standby Mode" name="ESTDBY" value="0x07"/>
            </value-group>
        </module>
        <module name="OSC" id="I6079" caption="Oscillator">
            <register-group caption="Oscillator" name="OSC" size="7">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="PLL Enable" mask="0x10" name="PLLEN"/>
                    <bitfield caption="External Oscillator Enable" mask="0x08" name="XOSCEN"/>
                    <bitfield caption="Internal 32kHz RC Oscillator Enable" mask="0x04" name="RC32KEN"/>
                    <bitfield caption="Internal 32MHz RC Oscillator Enable" mask="0x02" name="RC32MEN"/>
                    <bitfield caption="Internal 2MHz RC Oscillator Enable" mask="0x01" name="RC2MEN"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="PLL Ready" mask="0x10" name="PLLRDY"/>
                    <bitfield caption="External Oscillator Ready" mask="0x08" name="XOSCRDY"/>
                    <bitfield caption="Internal 32kHz RC Oscillator Ready" mask="0x04" name="RC32KRDY"/>
                    <bitfield caption="Internal 32MHz RC Oscillator Ready" mask="0x02" name="RC32MRDY"/>
                    <bitfield caption="Internal 2MHz RC Oscillator Ready" mask="0x01" name="RC2MRDY"/>
                </register>
                <register caption="External Oscillator Control Register" name="XOSCCTRL" offset="0x02" size="1">
                    <bitfield caption="Frequency Range" mask="0xC0" name="FRQRANGE" values="OSC_FRQRANGE"/>
                    <bitfield caption="32kHz XTAL OSC Low-power Mode" mask="0x20" name="X32KLPM"/>
                    <bitfield caption="External Oscillator Selection and Startup Time" mask="0x0F" name="XOSCSEL"
                              values="OSC_XOSCSEL"/>
                </register>
                <register caption="External Oscillator Failure Detection Register" name="XOSCFAIL" offset="0x03"
                          size="1">
                    <bitfield caption="Failure Detection Interrupt Flag" mask="0x02" name="XOSCFDIF"/>
                    <bitfield caption="Failure Detection Enable" mask="0x01" name="XOSCFDEN"/>
                </register>
                <register caption="32kHz Internal Oscillator Calibration Register" name="RC32KCAL" offset="0x04"
                          size="1"/>
                <register caption="PLL Control REgister" name="PLLCTRL" offset="0x05" size="1">
                    <bitfield caption="Clock Source" mask="0xC0" name="PLLSRC" values="OSC_PLLSRC"/>
                    <bitfield caption="Multiplication Factor" mask="0x1F" name="PLLFAC"/>
                </register>
                <register caption="DFLL Control Register" name="DFLLCTRL" offset="0x06" size="1">
                    <bitfield caption="32MHz Calibration Reference" mask="0x02" name="RC32MCREF"/>
                    <bitfield caption="2MHz Calibration Reference" mask="0x01" name="RC2MCREF"/>
                </register>
            </register-group>
            <value-group caption="Oscillator Frequency Range" name="OSC_FRQRANGE">
                <value caption="0.4 - 2 MHz" name="04TO2" value="0x00"/>
                <value caption="2 - 9 MHz" name="2TO9" value="0x01"/>
                <value caption="9 - 12 MHz" name="9TO12" value="0x02"/>
                <value caption="12 - 16 MHz" name="12TO16" value="0x03"/>
            </value-group>
