bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA64D3.xml
                <register caption="Device ID byte 2" name="DEVID2" offset="0x02" size="1"/>
                <register caption="Revision ID" name="REVID" offset="0x03" size="1"/>
                <register caption="JTAG User ID" name="JTAGUID" offset="0x04" size="1"/>
                <register caption="MCU Control" name="MCUCR" offset="0x06" size="1">
                    <bitfield caption="JTAG Disable" mask="0x01" name="JTAGD"/>
                </register>
                <register caption="Event System Lock" name="EVSYSLOCK" offset="0x08" size="1">
                    <bitfield caption="Event Channel 4-7 Lock" mask="0x10" name="EVSYS1LOCK"/>
                    <bitfield caption="Event Channel 0-3 Lock" mask="0x01" name="EVSYS0LOCK"/>
                </register>
                <register caption="AWEX Lock" name="AWEXLOCK" offset="0x09" size="1">
                    <bitfield caption="AWeX on T/C E0 Lock" mask="0x04" name="AWEXELOCK"/>
                    <bitfield caption="AWeX on T/C C0 Lock" mask="0x01" name="AWEXCLOCK"/>
                </register>
            </register-group>
        </module>
        <module name="PMIC" caption="Programmable Multi-level Interrupt Controller" id="I6057">
            <register-group name="PMIC" caption="Programmable Multi-level Interrupt Controller" size="16">
                <register name="STATUS" caption="Status Register" size="1" offset="0x00">
                    <bitfield name="NMIEX" caption="Non-maskable Interrupt Executing" mask="0x80"/>
                    <bitfield name="HILVLEX" caption="High Level Interrupt Executing" mask="0x04"/>
                    <bitfield name="MEDLVLEX" caption="Medium Level Interrupt Executing" mask="0x02"/>
                    <bitfield name="LOLVLEX" caption="Low Level Interrupt Executing" mask="0x01"/>
                </register>
                <register name="INTPRI" caption="Interrupt Priority" size="1" offset="0x01">
                    <bitfield name="INTPRI" caption="Interrupt Priority" mask="0xFF"/>
                </register>
                <register name="CTRL" caption="Control Register" size="1" offset="0x02">
                    <bitfield name="RREN" caption="Round-Robin Priority Enable" mask="0x80"/>
                    <bitfield name="IVSEL" caption="Interrupt Vector Select" mask="0x40"/>
                    <bitfield name="HILVLEN" caption="High Level Enable" mask="0x04"/>
                    <bitfield name="MEDLVLEN" caption="Medium Level Enable" mask="0x02"/>
                    <bitfield name="LOLVLEN" caption="Low Level Enable" mask="0x01"/>
                </register>
            </register-group>
        </module>
        <module name="CRC" id="I6111" version="XMEGAD" caption="Cyclic Redundancy Checker">
            <register-group caption="Cyclic Redundancy Checker" name="CRC" size="8">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Reset" mask="0xC0" name="RESET" values="CRC_RESET"/>
                    <bitfield caption="CRC Mode" mask="0x20" name="CRC32"/>
                    <bitfield caption="Input Source" mask="0x0F" name="SOURCE" values="CRC_SOURCE"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Zero detection" mask="0x02" name="ZERO"/>
                    <bitfield caption="Busy" mask="0x01" name="BUSY"/>
                </register>
                <register caption="Data Input" name="DATAIN" offset="0x03" size="1"/>
                <register caption="Checksum byte 0" name="CHECKSUM0" offset="0x04" size="1"/>
                <register caption="Checksum byte 1" name="CHECKSUM1" offset="0x05" size="1"/>
                <register caption="Checksum byte 2" name="CHECKSUM2" offset="0x06" size="1"/>
                <register caption="Checksum byte 3" name="CHECKSUM3" offset="0x07" size="1"/>
            </register-group>
            <value-group caption="Reset" name="CRC_RESET">
                <value caption="No Reset" name="NO" value="0x00"/>
                <value caption="Reset CRC with CHECKSUM to all zeros" name="RESET0" value="0x02"/>
                <value caption="Reset CRC with CHECKSUM to all ones" name="RESET1" value="0x03"/>
            </value-group>
            <value-group caption="Input Source" name="CRC_SOURCE">
                <value caption="Disabled" name="DISABLE" value="0x00"/>
                <value caption="I/O Interface" name="IO" value="0x01"/>
                <value caption="Flash" name="FLASH" value="0x02"/>
            </value-group>
        </module>
        <module name="EVSYS" id="I6061" version="XMEGAD" caption="Event System">
            <register-group caption="Event System" name="EVSYS" size="18">
                <register caption="Event Channel 0 Multiplexer" name="CH0MUX" offset="0x00" size="1">
                    <bitfield caption="Event Channel 0 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Event Channel 1 Multiplexer" name="CH1MUX" offset="0x01" size="1">
                    <bitfield caption="Event Channel 1 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Event Channel 2 Multiplexer" name="CH2MUX" offset="0x02" size="1">
                    <bitfield caption="Event Channel 2 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Event Channel 3 Multiplexer" name="CH3MUX" offset="0x03" size="1">
                    <bitfield caption="Event Channel 3 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Channel 0 Control Register" name="CH0CTRL" offset="0x08" size="1">
                    <bitfield caption="Quadrature Decoder Index Recognition Mode" mask="0x60" name="QDIRM"
                              values="EVSYS_QDIRM"/>
                    <bitfield caption="Quadrature Decoder Index Enable" mask="0x10" name="QDIEN"/>
                    <bitfield caption="Quadrature Decoder Enable" mask="0x08" name="QDEN"/>
                    <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
                </register>
